[
  {
    "id": "VIGILANT Weekly Update",
    "title": "VIGILANT Weekly Update",
    "menuTitle": "VIGILANT Weekly Update",
    "dateISO": "2026-01-22",
    "thumbnail": "/assets/images/research/1.jpg",
    "desc": "This weekly update introduces new members of the VIGILANT research team and summarizes the current progress of the project, including recent technical milestones and upcoming publication plans.",
    "research": [
      {
        "title": "VIGILANT Weekly Team Meeting",
        "date": "January 22, 2026",
        "desc": "Four new researchers from Professor Yoon Guk-jin’s laboratory have officially joined the VIGILANT project. The team has successfully completed improvements to the Neural Network and Reinforcement Learning policy, achieving performance comparable to a fixed-camera baseline. Based on these results, the team is currently preparing a paper for submission to IROS, with a target submission date in early March.",
        "images": [
          "/assets/images/research/1.jpg",
          "/assets/images/research/1-1.jpg"
        ]
      }
    ]
  },
  {
    "id": "Prism-X Research Update",
    "title": "Prism-X Research Update",
    "menuTitle": "Prism-X Research Update",
    "dateISO": "2026-01-27",
    "desc": "This research update summarizes ongoing work on spatial accessibility metrics and AgentSUMO-based simulation reasoning, focusing on policy-relevant accessibility frameworks and language-driven inference over transportation network disruptions.",
    "research": [
      {
        "title": "Documenting Spatial Accessibility Indicators",
        "date": "January 27, 2026",
        "desc": "Professor Lee Tae-sik’s laboratory has systematically documented spatial accessibility indicators by organizing them around underlying policy questions. The study reviews key accessibility formulations—including proximity-based, coverage-based, gravity-based, congestion-aware, and network-based measures—and maps each class to specific policy concerns such as service reachability, opportunity availability, congestion effects, and system-wide mobility efficiency. By linking accessibility taxonomies directly to policy questions, this work proposes a generalized framework for selecting appropriate accessibility metrics. The framework is intended to serve as a standard reference for future urban policy design and spatial analysis, while also highlighting structural limitations of existing indicators and their sensitivity to methodological and spatial parameter choices."
      },
      {
        "title": "SUMO Language Expert: AgentSUMO Evaluation",
        "date": "January 27, 2026",
        "desc": "Approximately 200 SUMO simulation scenarios were generated by systematically removing individual edges from a fixed transportation network. The scenarios were split into training (80%) and testing (20%) sets. Training data were stored in a SQLite database accessible to AgentSUMO, while test results remained hidden. The evaluation task asks questions such as identifying which road experiences the largest increase in waiting time when a specific edge is removed, relative to a baseline. AgentSUMO answers these queries by performing text-to-SQL searches over the training data and inferring the correct test outcomes. Current performance is limited by low answer accuracy, partly due to insufficient transparency in SQL generation and scenario selection. To address this bottleneck, ongoing work focuses on exposing generated SQL queries alongside final answers and systematically comparing different retrieval strategies, including free-form LLM-generated SQL, neighbor-based searches, cross-axis road searches, exhaustive searches, and heuristic rule-based approaches."
      }
    ]
  }
]